In [7]:
import numpy as np
import pandas as pd

my_numbers = [12,21,54,22]
my_letters = ['A', 'B', 'C', 'D']
new_pandas_list = pd.Series(my_numbers)
# new_pandas_list[2]
merge_pandas = pd.Series(my_numbers, my_letters) # concat 2 the same size of tables
merge_pandas

A    12
B    21
C    54
D    22
dtype: int64

In [9]:
from numpy.random import randn

my_data = randn(4,3)
my_letter = ['A', 'B', 'C']   

my_df=pd.DataFrame(my_data, my_numbers, my_letter)
my_df

           A         B         C
12  0.296429  0.165556 -0.354902
21  0.445840  1.444215 -0.148883
54  0.748088  0.781741 -0.553663
22 -0.891591 -0.311328  1.328963

In [13]:
data = pd.read_csv('homeprices.csv')
data.loc[:]

               town  area   price
0   monroe township  2600  550000
1   monroe township  3000  565000
2   monroe township  3200  610000
3   monroe township  3600  680000
4   monroe township  4000  725000
5      west windsor  2600  585000
6      west windsor  2800  615000
7      west windsor  3300  650000
8      west windsor  3600  710000
9       robinsville  2600  575000
10      robinsville  2900  600000
11      robinsville  3100  620000
12      robinsville  3600  695000

In [14]:
data.head(5) # can be use to get the first 5 rows

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [15]:
data.tail(5) # can be used the last 5 rows

            town  area   price
8   west windsor  3600  710000
9    robinsville  2600  575000
10   robinsville  2900  600000
11   robinsville  3100  620000
12   robinsville  3600  695000

In [17]:
data.info() # to get more info about the set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   town    13 non-null     object
 1   area    13 non-null     int64
 2   price   13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 440.0+ bytes

In [19]:
data.shape # to get the shape of my cvs

(13, 3)

In [20]:
data.ndim # to get the dimension of my table.

2

In [21]:
data.dtypes# to get types of table

town     object
area      int64
price     int64
dtype: object

In [22]:
data.describe() # to get some point about the table

              area          price
count    13.000000      13.000000
mean   3146.153846  629230.769231
std     453.900475   57621.109914
min    2600.000000  550000.000000
25%    2800.000000  585000.000000
50%    3100.000000  615000.000000
75%    3600.000000  680000.000000
max    4000.000000  725000.000000

In [23]:
data['town'].describe() # to get info about certain col

count                  13
unique                  3
top       monroe township
freq                    5
Name: town, dtype: object

In [24]:
data ['town'] ======= data.town # can back the all elements of the cols

0     monroe township
1     monroe township
2     monroe township
3     monroe township
4     monroe township
5        west windsor
6        west windsor
7        west windsor
8        west windsor
9         robinsville
10        robinsville
11        robinsville
12        robinsville
Name: town, dtype: object

In [27]:
data.town.value_counts(ascending = True) # can count the all values of town

west windsor       4
robinsville        4
monroe township    5
Name: town, dtype: int64

In [30]:
data.drop(['area'], axis = 1)

               town   price
0   monroe township  550000
1   monroe township  565000
2   monroe township  610000
3   monroe township  680000
4   monroe township  725000
5      west windsor  585000
6      west windsor  615000
7      west windsor  650000
8      west windsor  710000
9       robinsville  575000
10      robinsville  600000
11      robinsville  620000
12      robinsville  695000

In [38]:
# data.set_index('price') to set price as index
# data.reset_index()
data

                   town  area
price
550000  monroe township  2600
565000  monroe township  3000
610000  monroe township  3200
680000  monroe township  3600
725000  monroe township  4000
585000     west windsor  2600
615000     west windsor  2800
650000     west windsor  3300
710000     west windsor  3600
575000      robinsville  2600
600000      robinsville  2900
620000      robinsville  3100
695000      robinsville  3600

In [43]:
def times(x):
  return x * 2 


pd.DataFrame(data['area'].apply(times))

data.area.sort_values()

price
550000    2600
585000    2600
575000    2600
615000    2800
600000    2900
565000    3000
620000    3100
610000    3200
650000    3300
680000    3600
710000    3600
695000    3600
725000    4000
Name: area, dtype: int64

In [ ]:
# new_data = pd.read_csv('bmi.py' , sep = '\t') open the exist file
print (new_data.head(1)) # head means open the only neccesary part of my data.
print(new_data)

filtered_data = new_data['weight'] > 50
print(filtered_data)

my_new_name = new_data.replace('Azizbek','Aziz')
print(my_new_name)

drop_col = new_data.drop('bmi', axis = 1) # if I want to drop more than 1 col I use ['bmi','name']
print(drop_col)

remove_row = new_data.iloc[0:1] # means 'iloc' can be use to delete the certain row
print(remove_row)

jam_data = jam_data.drop_dublicates(subset = ['name']) # means go to the name table th of the '.csv' file
#drop the same names in the col.